package yt.com.easylife.bean;

import java.util.List;

/**
 * author  : LSM
 * time    : 2018/03/07
 * function:
 * e-mail  : lsmloveu@126.com
 * github  : https://github.com/lsmloveu
 * csdn    : http://blog.csdn.net/csdn_android_lsm
 * 简书    : http://www.jianshu.com/u/644036b17b6f
 */

public class MusicBean {

    /**
     * data : [{"type":"qq","link":"http://y.qq.com/n/yqq/song/004emQMs09Z1lz.html","songid":"004emQMs09Z1lz","title":"烟花易冷","author":"周杰伦","lrc":"[ti:烟花易冷]\n[ar:周杰伦]\n[al:263287]\n[by:]\n[offset:0]\n[00:00.10]烟花易冷 - 周杰伦\n[00:00.20]词：方文山\n[00:00.30]曲：周杰伦\n[00:00.40]\n[00:11.49]繁华声 遁入空门 折煞了世人\n[00:16.54]\n[00:17.55]梦偏冷 辗转一生 情债又几本\n[00:23.10]\n[00:23.99]如你默认 生死枯等\n[00:29.29]\n[00:29.99]枯等一圈 又一圈的 年轮\n[00:36.55]浮屠塔 断了几层 断了谁的魂\n[00:41.85]\n[00:42.43]痛直奔 一盏残灯 倾塌的山门\n[00:48.42]\n[00:48.93]容我再等 历史转身\n[00:54.10]\n[00:55.37]等酒香醇 等你弹 一曲古筝\n[01:01.55]雨纷纷 旧故里草木深\n[01:06.54]\n[01:07.87]我听闻 你始终一个人\n[01:12.82]\n[01:14.02]斑驳的城门 盘踞着老树根\n[01:20.15]石板上回荡的是 再等\n[01:25.26]\n[01:26.46]雨纷纷 旧故里草木深\n[01:31.45]\n[01:32.96]我听闻 你仍守着孤城\n[01:38.01]\n[01:39.02]城郊牧笛声 落在那座野村\n[01:45.21]缘份落地生根是 我们\n[01:50.13]\n[01:54.40]听青春 迎来笑声 羡煞许多人\n[01:59.57]\n[02:00.40]那史册 温柔不肯 下笔都太狠\n[02:06.71]烟花易冷 人事易分\n[02:12.01]\n[02:12.84]而你在问 我是否还 认真\n[02:18.39]\n[02:19.02]千年后 累世情深 还有谁在等\n[02:25.33]而青史 岂能不真 魏书洛阳城\n[02:31.84]如你在跟 前世过门\n[02:36.95]\n[02:38.15]跟着红尘 跟随我 浪迹一生\n[02:43.20]\n[02:44.40]雨纷纷 旧故里草木深\n[02:49.38]\n[02:50.65]我听闻 你始终一个人\n[02:55.70]\n[02:56.90]斑驳的城门 盘踞着老树根\n[03:03.08]石板上回荡的是 再等\n[03:09.34]雨纷纷 旧故里草木深\n[03:14.32]\n[03:15.52]我听闻 你仍守着孤城\n[03:21.32]\n[03:21.90]城郊牧笛声 落在那座野村\n[03:28.02]缘份落地生根是 我们\n[03:33.82]\n[03:35.01]雨纷纷 旧故里草木深\n[03:36.61]我听闻 你始终一个人\n[03:38.59]斑驳的城门 盘踞着老树根\n[03:40.35]石板上回荡的是 再等\n[03:41.86]雨纷纷 雨纷纷 旧故里草木深\n[03:45.02]我听闻 我听闻 你仍守着孤城\n[03:47.61]城郊牧笛声 落在那座野村\n[03:53.32]缘份落地生根是 我们\n[03:58.17]\n[03:59.58]缘份落地生根是 我们\n[04:04.36]\n[04:05.77]伽蓝寺听雨声盼 永恒","url":"http://dl.stream.qqmusic.qq.com/M800004emQMs09Z1lz.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000000bviBl4FjTpO.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001PGGQ81Xxw9l.html","songid":"001PGGQ81Xxw9l","title":"烟花易冷 (Live)","author":"林志炫","lrc":"[ti:烟花易冷]\n[ar:林志炫]\n[al:我是歌手 第6期]\n[by:]\n[offset:0]\n[00:00.46]烟花易冷 - 林志炫\n[00:02.46]词：方文山\n[00:03.96]曲：周杰伦\n[00:05.78]\n[00:12.65]繁华声 遁入空门\n[00:15.34]折煞了世人\n[00:19.71]梦偏冷 辗转一生\n[00:22.34]情债又几本\n[00:26.84]如你默认 生死枯等\n[00:33.84]枯等一圈 又一圈的年轮\n[00:41.65]浮图塔 断了几层\n[00:44.28]断了谁的魂\n[00:48.59]痛直奔 一盏残灯\n[00:51.22]倾塌的山门\n[00:53.28]\n[00:55.43]容我再等 历史转身\n[01:03.07]等酒香醇 等你弹\n[01:05.89]一曲古筝\n[01:10.14]雨纷纷 旧故里草木深\n[01:16.63]我听闻 你始终一个人\n[01:23.84]斑驳的城门 盘踞着老树根\n[01:31.11]石板上回荡的是 再等\n[01:35.68]\n[01:38.28]雨纷纷 旧故里草木深\n[01:45.28]我听闻 你仍守着孤城\n[01:52.15]城郊牧笛声 落在那座野村\n[01:59.71]缘份落地生根是 我们\n[02:07.97]\n[02:42.73]听青春 迎来笑声\n[02:45.36]羡煞许多人\n[02:49.54]那史册 温柔不肯\n[02:52.17]下笔都太狠\n[02:56.29]烟花易冷 人事易分\n[03:03.11]而你在问 我是否还认真\n[03:10.17]千年后 累世情深\n[03:12.98]还有谁在等\n[03:17.12]而青史 岂能不真\n[03:19.75]魏书洛阳城\n[03:23.62]如你在跟 前世过门\n[03:31.12]跟着红尘 跟随我\n[03:34.12]浪迹一生\n[03:38.18]雨纷纷 旧故里草木深\n[03:45.18]我听闻 你始终一个人\n[03:52.31]斑驳的城门 盘踞着老树根\n[03:59.45]石板上回荡的是 再等\n[04:06.64]雨纷纷 旧故里草木深\n[04:13.41]我听闻 你仍守着孤城\n[04:20.75]城郊牧笛声 落在那座野村\n[04:28.99]缘份落地生根是 我们\n[04:36.86]缘份落地生根是 我们\n[04:44.23]伽蓝寺听雨声盼 永恒","url":"http://dl.stream.qqmusic.qq.com/M800001PGGQ81Xxw9l.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000003XTB311VAqGw.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/002HQJxz0YIrDY.html","songid":"002HQJxz0YIrDY","title":"烟花易冷 (Live)","author":"李维","lrc":"[ti:烟花易冷 (Live)]\n[ar:李维]\n[al:中国新歌声第二季 第14期]\n[by:]\n[offset:0]\n[00:00.00]烟花易冷 (Live) - 李维\n[00:00.73]词：方文山\n[00:00.90]曲：周杰伦\n[00:01.63]原唱：周杰伦\n[00:02.97]\n[00:11.95]繁华声遁入空门折煞了世人\n[00:16.88]\n[00:17.89]梦偏冷辗转一生情债又几本\n[00:23.10]\n[00:24.22]如你默认\n[00:26.52]\n[00:27.27]生死枯等\n[00:29.55]\n[00:30.64]枯等一圈\n[00:32.11]\n[00:32.82]又一圈的年轮\n[00:35.10]\n[00:36.75]浮图塔断了几层\n[00:39.38]断了谁的魂\n[00:41.82]\n[00:42.86]痛直奔一盏残灯\n[00:45.62]倾塌的山门\n[00:48.37]\n[00:49.18]容我再等历史转身\n[00:54.04]\n[00:55.75]等酒香醇等你弹一曲古筝\n[01:00.74]\n[01:01.97]雨纷纷\n[01:03.22]\n[01:03.88]旧故里草木深\n[01:07.28]\n[01:08.20]我听闻\n[01:09.61]\n[01:10.16]你始终一个人\n[01:13.56]\n[01:14.44]斑驳的城门\n[01:17.06]\n[01:17.57]盘踞着老树根\n[01:20.69]石板上回荡的是再等\n[01:25.12]\n[01:26.92]雨纷纷\n[01:28.84]旧故里草木深\n[01:31.38]\n[01:33.16]我听闻\n[01:34.48]\n[01:35.15]你仍守着孤城\n[01:37.96]\n[01:39.40]城郊牧笛声\n[01:41.98]\n[01:42.52]落在那座野村\n[01:45.65]缘分落地生根是我们\n[01:50.22]\n[01:54.86]听青春迎来笑声羡煞许多人\n[01:59.81]\n[02:00.84]那史册温柔不肯下笔都太狠\n[02:06.07]\n[02:07.07]烟花易冷\n[02:09.28]\n[02:10.23]人事易分\n[02:12.05]\n[02:13.53]而你在问\n[02:15.01]\n[02:15.64]我是否还认真\n[02:18.40]\n[02:19.61]千年后累世情深还有谁在等\n[02:24.44]\n[02:25.83]而青史岂能不真魏书洛阳城\n[02:31.10]\n[02:32.08]如你在跟\n[02:33.85]\n[02:35.09]前世过门\n[02:37.11]\n[02:38.54]跟着红尘跟随我浪迹一生\n[02:43.51]\n[02:44.82]雨纷纷\n[02:46.00]\n[02:46.70]旧故里草木深\n[02:49.72]\n[02:51.09]我听闻\n[02:52.27]\n[02:52.96]你始终一个人\n[02:55.82]\n[02:57.28]斑驳的城门\n[03:00.42]盘踞着老树根\n[03:03.56]石板上回荡的是再等\n[03:08.26]\n[03:09.68]雨纷纷\n[03:11.11]\n[03:11.68]旧故里草木深\n[03:14.92]\n[03:15.99]我听闻\n[03:17.28]\n[03:17.86]你仍守着孤城\n[03:21.03]\n[03:22.17]城郊牧笛声落在那座野村\n[03:28.46]缘分落地生根是我们\n[03:33.46]\n[03:34.66]伽蓝寺听雨声盼永恒","url":"http://dl.stream.qqmusic.qq.com/M800002HQJxz0YIrDY.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001hDUGQ4OTEXL.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/003hNGqU2AeXfJ.html","songid":"003hNGqU2AeXfJ","title":"烟花易冷 (京剧版)","author":"霍尊","lrc":"[ti:烟花易冷 (京剧版)]\n[ar:霍尊]\n[al:国色天香第二季 第十三期]\n[by:]\n[offset:0]\n[00:00.00]烟花易冷 (京剧版) (Live) - 霍尊\n[00:00.43]词：方文山\n[00:00.60]曲：周杰伦\n[00:00.97]\n[00:29.71]繁华声遁入空门\n[00:32.66]折煞了世人\n[00:36.01]\n[00:36.96]梦偏冷辗转一生\n[00:39.90]情债又几本\n[00:43.43]\n[00:44.27]如你默认\n[00:46.84]\n[00:47.88]生死枯等\n[00:50.91]\n[00:51.78]枯等一圈\n[00:54.41]又一圈的年轮\n[00:58.36]\n[00:59.04]浮图塔断了几层\n[01:02.14]断了谁的魂\n[01:05.53]\n[01:06.40]痛直奔 一盏残灯\n[01:09.47]倾塌的山门\n[01:13.19]\n[01:13.79]容我再等\n[01:17.61]历史转身\n[01:20.68]\n[01:21.60]等酒香醇\n[01:23.36]等你弹一曲古筝\n[01:28.00]\n[01:29.13]雨纷纷旧故里草木深\n[01:35.79]\n[01:36.48]我听闻\n[01:38.71]你始终一个人\n[01:43.89]斑驳的城门\n[01:47.35]盘踞着老树根\n[01:50.98]石板上回荡的是再等\n[01:57.95]\n[01:58.63]雨纷纷旧故里草木深\n[02:05.51]\n[02:06.03]我听闻你仍守着孤城\n[02:13.26]城郊牧笛声\n[02:16.97]落在那座野村\n[02:20.64]缘分落地生根是我们\n[02:28.22]\n[02:46.47]繁华声遁入空门\n[02:49.14]折煞了世人\n[02:52.40]\n[02:53.57]梦偏冷辗转一生\n[02:56.62]情债又几本\n[02:59.88]\n[03:00.89]如你默认\n[03:03.31]\n[03:04.58]生死枯等\n[03:07.46]\n[03:08.34]枯等一圈\n[03:10.51]\n[03:11.15]又一圈的年轮\n[03:15.02]\n[03:15.74]浮图塔\n[03:16.93]断了几层\n[03:18.80]断了谁的魂\n[03:22.11]\n[03:22.99]痛直奔 一盏残灯\n[03:26.10]倾塌的山门\n[03:29.78]\n[03:30.51]容我再等\n[03:34.08]历史转身\n[03:37.34]\n[03:38.31]等酒香醇\n[03:39.95]等你弹一曲古筝\n[03:44.53]\n[03:45.64]雨纷纷\n[03:47.79]旧故里草木深\n[03:52.14]\n[03:52.97]我听闻\n[03:55.25]你始终一个人\n[04:00.32]斑驳的城门\n[04:03.98]盘踞着老树根\n[04:07.54]石板上回荡的是再等\n[04:14.39]\n[04:15.23]雨纷纷旧故里草木深\n[04:21.57]\n[04:22.42]我听闻你仍守着孤城\n[04:29.95]城郊牧笛声\n[04:33.49]落在那座野村\n[04:37.20]缘分落地生根是 我们\n[04:44.10]\n[04:44.72]缘分落地生根是 我们\n[04:52.29]伽蓝寺听雨声盼 永恒","url":"http://dl.stream.qqmusic.qq.com/M500003hNGqU2AeXfJ.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000000Pfj2o3Ikuqc.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001dTNcs2DTC3B.html","songid":"001dTNcs2DTC3B","title":"烟花易冷 (Live)","author":"刘彩星","lrc":"[ti:烟花易冷(live版)]\n[ar:刘彩星]\n[al:我爱好声音 第8期]\n[by:]\n[offset:0]\n[00:00.88]烟花易冷 (Live) - 刘彩星\n[00:03.30]词：方文山\n[00:04.61]曲：周杰伦\n[00:23.15]繁华声 遁入空门\n[00:25.75]折煞了世人\n[00:29.00]\n[00:30.37]梦偏冷 辗转一生\n[00:32.75]情债又几本\n[00:35.24]\n[00:36.70]如你默认 生死枯等\n[00:42.39]\n[00:43.75]枯等一圈 又一圈的年轮\n[00:49.23]\n[00:50.63]浮图塔 断了几层\n[00:53.41]断了谁的魂\n[00:56.55]\n[00:57.64]痛直奔 辗转一生\n[01:00.15]倾塌的山门\n[01:03.23]\n[01:03.94]如你再等 生死枯等\n[01:09.89]\n[01:11.46]等酒香醇 等你弹\n[01:13.98]一曲古筝\n[01:17.02]\n[01:17.70]雨纷纷 旧故里草木深\n[01:22.86]\n[01:24.63]我听闻 你始终一个人\n[01:30.41]\n[01:31.38]斑驳的城门 盘踞着老树根\n[01:37.97]\n[01:38.47]石板上回荡的是 再等\n[01:44.27]\n[01:48.64]雨纷纷 旧故里草木深\n[01:54.75]\n[01:55.41]我听闻 你始终一个人\n[02:01.65]\n[02:02.39]斑驳的城门 盘踞着老树根\n[02:09.48]石板上回荡的是 再等\n[02:15.59]\n[02:16.49]雨纷纷 旧故里草木深\n[02:22.82]\n[02:23.55]我听闻 你仍守着孤城\n[02:30.65]城郊牧笛声 落在那座野村\n[02:37.35]\n[02:38.04]缘份落地生根是 我们\n[02:43.49]\n[02:45.23]缘份落地生根是 我们\n[02:52.71]\n[02:54.03]伽蓝寺听雨声盼 永恒","url":"http://dl.stream.qqmusic.qq.com/M500001dTNcs2DTC3B.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001TtbgE1pYZeH.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/002b6s2O2hzROs.html","songid":"002b6s2O2hzROs","title":"烟花易冷","author":"夏末","lrc":"[ti:烟花易冷]\n[ar:夏末]\n[al:烟花易冷]\n[by:]\n[offset:0]\n[00:00.45]烟花易冷 - 夏末\n[00:01.77]词：顾城\n[00:02.57]曲：顾城\n[00:03.43]\n[00:27.36]听着情歌我在想谁\n[00:30.34]那个谁不能体会\n[00:33.30]为什么我又流眼泪\n[00:37.04]\n[00:39.35]窗外的天空一片灰\n[00:42.27]你最害怕雨前的雷\n[00:45.22]现在是否会有人陪\n[00:49.20]\n[00:51.31]我已经开始无所谓\n[00:54.29]尽管说我有多虚伪\n[00:57.28]我也不会再去理会\n[01:00.77]\n[01:03.37]藏好我的所有伤悲\n[01:06.25]慢慢擦干我的眼泪\n[01:09.24]不再需要同情安慰\n[01:13.71]\n[01:14.27]你留给我的伤悲\n[01:17.56]我学会面对\n[01:20.58]尽管一个人的夜里有多黑\n[01:25.93]\n[01:26.60]反正你都无所谓\n[01:29.62]我难过流泪\n[01:32.61]我的狼狈不用你体会\n[01:38.90]\n[02:03.50]听着情歌我在想谁\n[02:06.36]那个谁不能体会\n[02:09.34]为什么我又流眼泪\n[02:12.76]\n[02:15.38]窗外的天空一片灰\n[02:18.37]你最害怕雨前的雷\n[02:21.35]现在是否会有人陪\n[02:25.97]\n[02:27.40]我已经开始无所谓\n[02:30.33]尽管说我有多虚伪\n[02:33.37]我也不会再去理会\n[02:36.92]\n[02:39.37]藏好我的所有伤悲\n[02:42.32]慢慢擦干我的眼泪\n[02:45.29]不再需要同情安慰\n[02:50.13]\n[02:50.64]你留给我的伤悲\n[02:53.60]我学会面对\n[02:56.61]尽管一个人的夜里有多黑\n[03:02.09]\n[03:02.61]反正你都无所谓\n[03:05.60]我难过流泪\n[03:08.60]我的狼狈不用你体会","url":"http://dl.stream.qqmusic.qq.com/M800002b6s2O2hzROs.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000000AE0AM4JVnle.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001wyoAt2j6LcD.html","songid":"001wyoAt2j6LcD","title":"烟花易冷","author":"曹芙嘉","lrc":"[ti:烟花易冷]\n[ar:曹芙嘉]\n[al:此去经年]\n[by:]\n[offset:0]\n[00:00.05]烟花易冷 - 曹芙嘉\n[00:00.78]词：方文山\n[00:00.94]曲：周杰伦\n[00:01.11]编曲：黄雨勋\n[00:01.60]\n[00:14.31]繁华声遁入空门 折煞了世人\n[00:20.11]\n[00:21.21]梦偏冷辗转一生 情债又几本\n[00:27.01]\n[00:28.50]如你默认 生死枯等\n[00:34.41]\n[00:35.71]枯等一圈 又一圈的 年轮\n[00:42.00]\n[00:42.72]浮屠塔断了几层 断了谁的魂\n[00:48.85]\n[00:49.93]痛直奔一盏残灯 倾塌的山门\n[00:55.69]\n[00:56.98]容我再等 历史转身\n[01:03.43]\n[01:04.51]等酒香醇 等你弹一曲古筝\n[01:10.33]\n[01:11.70]雨纷纷 旧故里草木深\n[01:17.68]\n[01:18.90]我听闻 你始终一个人\n[01:24.63]\n[01:26.02]斑驳的城门 盘踞着老树根\n[01:32.76]\n[01:33.31]石板上回荡的是 再等\n[01:38.98]\n[01:40.35]雨纷纷 旧故里草木深\n[01:46.64]\n[01:47.63]我听闻 你仍守着孤城\n[01:53.63]\n[01:54.77]城郊牧笛声 落在那座野村\n[02:01.33]\n[02:01.97]缘分落地生根是我们\n[02:08.21]\n[02:30.27]听青春迎来笑声 羡煞许多人\n[02:35.89]\n[02:37.58]那史册温柔不肯 下笔都太狠\n[02:42.87]\n[02:44.42]烟花易冷 人事易分\n[02:49.94]\n[02:51.81]而你在问 我是否还 认真\n[02:58.03]\n[02:58.75]千年后累世情深 还有谁在等\n[03:04.44]\n[03:06.10]而青史岂能不真 魏书洛阳城\n[03:11.96]\n[03:13.15]如你在跟 前世过门\n[03:18.88]\n[03:20.74]跟着红尘 跟随我 浪迹一生\n[03:26.68]\n[03:27.75]雨纷纷 旧故里草木深\n[03:33.94]\n[03:34.95]我听闻 你始终一个人\n[03:41.30]\n[03:42.20]斑驳的城门 盘踞着老树根\n[03:49.36]石板上回荡的是 再等\n[03:55.43]\n[03:56.19]雨纷纷 旧故里草木深\n[04:03.19]\n[04:03.70]我听闻 你仍守着孤城\n[04:10.03]\n[04:10.89]城郊牧笛声 落在那座野村\n[04:18.08]缘分落地生根是我们\n[04:24.40]\n[04:25.29]伽蓝寺听雨声盼 永恒","url":"http://dl.stream.qqmusic.qq.com/M500001wyoAt2j6LcD.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000000aUN4G19HUlN.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/00216Pa74HTzvm.html","songid":"00216Pa74HTzvm","title":"烟花易冷 (伴奏)","author":"李先生","lrc":"[00:00:00]此歌曲为没有填词的纯音乐，请您欣赏","url":"http://dl.stream.qqmusic.qq.com/M80000216Pa74HTzvm.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000003pkoi51DUmTa.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001bOepH1z8wfo.html","songid":"001bOepH1z8wfo","title":"烟花易冷","author":"薛冬梅","lrc":"[ti:烟花易冷]\n[ar:薛冬梅]\n[al:只要你快乐]\n[by:]\n[offset:0]\n[00:00.20]烟花易冷 - 薛冬梅\n[00:02.31]词：薛冬梅\n[00:02.48]曲：薛冬梅\n[00:03.07]\n[00:15.45]让我摸摸你的长发\n[00:18.46]就能做个香甜的梦啊\n[00:21.55]今晚我不想要回家\n[00:24.59]两人独处会不会尴尬\n[00:27.83]别人都说我很奇葩\n[00:30.75]所有好情绪瞬间崩塌\n[00:34.01]你千万别把我丢下\n[00:36.89]一个人我真的害怕\n[00:41.45]我只是太过寂寞和孤独\n[00:45.84]\n[00:46.53]那么多年的伤心和无助\n[00:51.66]\n[00:52.67]你就像阳光照进了我的心\n[00:57.88]\n[00:58.85]只有你能让我感到安心\n[01:04.05]\n[01:04.94]我真的真的不能将你失去\n[01:09.76]\n[01:10.39]你能否永远将我抱在怀里\n[01:16.11]\n[01:29.51]让我摸摸你的长发\n[01:32.20]就能做个香甜的梦啊\n[01:35.36]今晚我不想要回家\n[01:38.40]两人独处会不会尴尬\n[01:41.66]别人都说我很奇葩\n[01:44.52]所有好情绪瞬间崩塌\n[01:47.72]你千万别把我丢下\n[01:50.62]一个人我真的害怕\n[01:55.22]我只是太过寂寞和孤独\n[01:59.48]\n[02:00.32]那么多年的伤心和无助\n[02:05.68]\n[02:06.41]你就像阳光照进了我的心\n[02:11.35]\n[02:12.58]只有你能让我感到安心\n[02:17.61]\n[02:18.83]我真的真的不能将你失去\n[02:23.56]\n[02:24.36]你能否永远将我抱在怀里\n[02:30.01]\n[02:31.16]你就像阳光照进了我的心\n[02:35.91]\n[02:37.21]只有你能让我感到安心\n[02:42.41]\n[02:43.41]我真的真的不能将你失去\n[02:48.38]\n[02:48.97]你能否永远将我抱在怀里","url":"http://dl.stream.qqmusic.qq.com/M800001bOepH1z8wfo.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000002O2wgp01Sgct.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/00078VVu2jU9KW.html","songid":"00078VVu2jU9KW","title":"烟花易冷","author":"夏洛菲","lrc":"[ti:烟花易冷]\n[ar:夏洛菲]\n[al:烟花易冷]\n[by:]\n[offset:0]\n[00:00.18]烟花易冷 - 夏洛菲\n[00:00.91]词：洋洋\n[00:01.04]曲：易凌\n[00:01.40]\n[00:30.96]黑色孤寂\n[00:33.15]挂满天际\n[00:36.06]\n[00:37.77]夜幕降临\n[00:39.90]掩埋了清醒\n[00:43.73]\n[00:44.65]冷风\n[00:45.88]吹折叶归所\n[00:48.12]无法带走 的遗憾是我的失落\n[00:56.54]\n[00:58.46]泪雨交错\n[01:00.42]胡乱坠落\n[01:03.52]\n[01:05.29]几重隔阂\n[01:07.80]无法承诺\n[01:11.29]一把情锁\n[01:13.32]禁锢了\n[01:15.57]贯彻寂寞\n[01:17.55]\n[01:18.16]俘获一个回忆角落\n[01:24.88]\n[01:25.92]雨水淋湿过往风诵忧伤\n[01:32.01]\n[01:32.68]心破碎记忆冰泛白成霜\n[01:38.73]借纸笔诉心肠心事流放\n[01:45.51]阴霾只是黎明前的绝望\n[01:52.94]\n[02:20.71]黑色孤寂\n[02:22.84]挂满天际\n[02:25.67]\n[02:27.56]夜幕降临\n[02:29.71]掩埋了清醒\n[02:33.20]\n[02:34.43]冷风\n[02:35.59]吹折叶归所\n[02:37.75]无法带走 的遗憾是我的失落\n[02:46.41]\n[02:48.14]泪雨交错\n[02:50.27]胡乱坠落\n[02:53.12]\n[02:54.96]几重隔阁\n[02:56.76]\n[02:57.52]无法承诺\n[03:00.95]一把情锁\n[03:03.17]禁锢了\n[03:04.45]\n[03:05.16]贯彻寂寞\n[03:07.81]俘获一个回忆角落\n[03:14.81]\n[03:15.60]雨水淋湿过往风诵忧伤\n[03:21.64]\n[03:22.35]心破碎记忆冰泛白成霜\n[03:28.42]借纸笔诉心肠心事流放\n[03:35.27]阴霾只是黎明前的绝望","url":"http://dl.stream.qqmusic.qq.com/M80000078VVu2jU9KW.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000000Egb0k36fBZv.jpg"}]
     * code : 200
     * error :
     */

    private int code;
    private String error;
    /**
     * type : qq
     * link : http://y.qq.com/n/yqq/song/004emQMs09Z1lz.html
     * songid : 004emQMs09Z1lz
     * title : 烟花易冷
     * author : 周杰伦
     * lrc : [ti:烟花易冷]
     [ar:周杰伦]
     [al:263287]
     [by:]
     [offset:0]
     [00:00.10]烟花易冷 - 周杰伦
     [00:00.20]词：方文山
     [00:00.30]曲：周杰伦
     [00:00.40]
     [00:11.49]繁华声 遁入空门 折煞了世人
     [00:16.54]
     [00:17.55]梦偏冷 辗转一生 情债又几本
     [00:23.10]
     [00:23.99]如你默认 生死枯等
     [00:29.29]
     [00:29.99]枯等一圈 又一圈的 年轮
     [00:36.55]浮屠塔 断了几层 断了谁的魂
     [00:41.85]
     [00:42.43]痛直奔 一盏残灯 倾塌的山门
     [00:48.42]
     [00:48.93]容我再等 历史转身
     [00:54.10]
     [00:55.37]等酒香醇 等你弹 一曲古筝
     [01:01.55]雨纷纷 旧故里草木深
     [01:06.54]
     [01:07.87]我听闻 你始终一个人
     [01:12.82]
     [01:14.02]斑驳的城门 盘踞着老树根
     [01:20.15]石板上回荡的是 再等
     [01:25.26]
     [01:26.46]雨纷纷 旧故里草木深
     [01:31.45]
     [01:32.96]我听闻 你仍守着孤城
     [01:38.01]
     [01:39.02]城郊牧笛声 落在那座野村
     [01:45.21]缘份落地生根是 我们
     [01:50.13]
     [01:54.40]听青春 迎来笑声 羡煞许多人
     [01:59.57]
     [02:00.40]那史册 温柔不肯 下笔都太狠
     [02:06.71]烟花易冷 人事易分
     [02:12.01]
     [02:12.84]而你在问 我是否还 认真
     [02:18.39]
     [02:19.02]千年后 累世情深 还有谁在等
     [02:25.33]而青史 岂能不真 魏书洛阳城
     [02:31.84]如你在跟 前世过门
     [02:36.95]
     [02:38.15]跟着红尘 跟随我 浪迹一生
     [02:43.20]
     [02:44.40]雨纷纷 旧故里草木深
     [02:49.38]
     [02:50.65]我听闻 你始终一个人
     [02:55.70]
     [02:56.90]斑驳的城门 盘踞着老树根
     [03:03.08]石板上回荡的是 再等
     [03:09.34]雨纷纷 旧故里草木深
     [03:14.32]
     [03:15.52]我听闻 你仍守着孤城
     [03:21.32]
     [03:21.90]城郊牧笛声 落在那座野村
     [03:28.02]缘份落地生根是 我们
     [03:33.82]
     [03:35.01]雨纷纷 旧故里草木深
     [03:36.61]我听闻 你始终一个人
     [03:38.59]斑驳的城门 盘踞着老树根
     [03:40.35]石板上回荡的是 再等
     [03:41.86]雨纷纷 雨纷纷 旧故里草木深
     [03:45.02]我听闻 我听闻 你仍守着孤城
     [03:47.61]城郊牧笛声 落在那座野村
     [03:53.32]缘份落地生根是 我们
     [03:58.17]
     [03:59.58]缘份落地生根是 我们
     [04:04.36]
     [04:05.77]伽蓝寺听雨声盼 永恒
     * url : http://dl.stream.qqmusic.qq.com/M800004emQMs09Z1lz.mp3?vkey=BBC515BB7800DD1C4DAD9A4EE75265E90FF942B100FCFAB1812FC492BF1AB3E4BD3992905A670F79C81E1F31F83E1167285B5B1592E70C31&guid=5150825362&fromtag=1
     * pic : http://y.gtimg.cn/music/photo_new/T002R300x300M000000bviBl4FjTpO.jpg
     */

    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getError() {
        return error;
    }

    public void setError(String error) {
        this.error = error;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        private String type;
        private String link;
        private String songid;
        private String title;
        private String author;
        private String lrc;
        private String url;
        private String pic;

        public String getType() {
            return type;
        }

        public void setType(String type) {
            this.type = type;
        }

        public String getLink() {
            return link;
        }

        public void setLink(String link) {
            this.link = link;
        }

        public String getSongid() {
            return songid;
        }

        public void setSongid(String songid) {
            this.songid = songid;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getLrc() {
            return lrc;
        }

        public void setLrc(String lrc) {
            this.lrc = lrc;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getPic() {
            return pic;
        }

        public void setPic(String pic) {
            this.pic = pic;
        }
    }
}
